app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save_without_session_maintenance
---
INSERT INTO `users` (`single_access_token`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `password_salt`, `persistence_token`, `login_count`, `login`, `last_login_at`, `email`) VALUES('Hp-D1gVbCUhZD0jyTJpr', '2009-07-24 18:25:44', '299191f175110822b549721f301e2a320fea4d9e9bb59fb951920ba1150265c799bc8b4fafe12500502dc636fad9f587caae54e94426737778f3a2762284fc90', 'rxDbNBGSxDnYFODuc5JV', '2009-07-24 18:25:44', 0, '_En0AgXsRROha1_c8fUP', 'b32f490d9112b572e6d947358f6940f1b92f7b864a6610ce3b2417113888d2774a49c8f6d2b08ec7024e94f811799a567b98f6cde77e423e184072ceaf48b4ae', 1, 'bmiller', NULL, 'bmiller@csun.edu')